README.org
#+title: PAPER 99: Improving Program Locality in the GC using Hotness

#+HTML_HEAD_EXTRA: <style> code { background: #ddd; padding: 2px; } </style>
#+HTML_HEAD_EXTRA: <style> body { width: 800px; margin: auto; } </style>
#+HTML_HEAD_EXTRA: <style> blockquote { background: #fcc; padding: 2px 14px 2px 14px; } </style>

* Overview

Paper 99 presents HCSGC, built on-top of the ZGC collector in
OpenJDK. HCSGC use the mutators (the applications' threads) to
relocate objects on the heap to improve their placement. As a
consequence of this design, objects touched by a mutator during
the relocation phase of the GC cycle will be laid out in access
order which may improve cache performance on subsequent accesses.
Furthermore, HCSGC can track objects' "hotness". An object is
"hot" if it was accessed during the last GC cycle, otherwise
"cold". During GC, hot objects and cold objects are segregated to
increase the density of hot objects, and weights can be assigned
to cold objects so that they count less towards the live bytes of
a ZGC memory page. This can be used to improve the selection of
what memory pages to relocate during GC, as GC is no longer only
concerned with freeing memory, but with improving object locality
in the program.

We demonstrate the impact of our design choices, and the
applicability of our techniques, through a selection of
benchmarks.

As the number of tuning knobs are relatively large, the paper
deals with 19 different configurations for each benchmark with
several runs (the exact number depending on the benchmark)
to reach a steady state. To save artefact reviewers' time, the we
provide a simple test script that generates Figure 4 from
the paper with a single run. We also provide
a medium-weight testing option to generate the full Figure 4-6 with
31 runs (same as in the paper).

The full benchmarks[fn::Except for SPECJbb2015 which cannot be
included due to copyright restrictions.] are also provided and can
take weeks to run, depending on the machine.

After the benchmarks are run, an HTML file is open that shows the
produced plots with links to the plots of the paper for
comparison.

This artefact consists of the following:

1. The sources for HCSGC in the form of a single patch file for
   OpenJDK (=0001-hcsgc.patch=).
2. The benchmark programs from our paper (§4):
   - Our "sanity check" micro benchmark from §4.4;
   - The JGraphT benchmark from §4.5; and
   - The DaCapo benchmark suite from which we run Tradebeans and h2 in §4.6.
   NOTE: Due to copyright restrictions, we cannot include SPECjbb2015 in the artefact.
3. A virtual machine containing all of the above, including
   pre-built OpenJDK and HCSGC. As many virtual machine
   environments do not support =perf= (which we rely on for cache
   statistics), the full experience of this artefact is likely ony
   possible with a native installation.
5. Scripts to automate running the the benchmarks and producing
   the plots.

Beware that this artefact requires several gigabytes of disk space
for all dependencies and the build itself.

* Getting Started

This section explains how to install HCSGC alongside an OpenJDK
baseline. [[Step-by-Step][The next section]] explains how to run the benchmarks.

Please note that OpenJDK is a large project with many
dependencies, and that that our HCSGC paper compares 19 different
configurations which naturally takes some time to run. We explain
simplifications made to keep time short to kick the tires, and how
to run the full benchmarks to reproduce the results from the paper
(possibly modulo =perf=, when running inside a virtual machine).

We provide two different ways to explore this artefact. To
kick-the-tires, we suggest Option 1 (prebuilt VM). For someone
working deep in this space or wanting to fully reproduce our
results, we suggestion Option 2 (manual native install).

- [[option0][Option 1]] is a full VM (~8GB) download. This requires no other setup or
  installation other than the virtual machine infrastructure.
- [[option2][Option 2]] is a set of manual instructions for how to build and
  install HCSGC on Debian/Ubuntu.

Notes: Option 1, due to running inside virtual machines, typically
*cannot* record perf data and may skew the results.


** OPTION 1: Pre-Packaged Virtual Machine <<option0>>

You can use your favorite virtualisation software. We have tested
this VM using [[https://www.virtualbox.org/][Virtual Box]].

After uncompressing the artifact, one can import the VM (=pldi.ova=) directly;
start and login to the VM with the following credentials:

#+BEGIN_EXAMPLE
user: vagrant
password: vagrant
#+END_EXAMPLE

See [[Step-by-Step][the next section]] for instructions for how to run the
benchmarks.

All interaction with the VM will happen in the terminal. The only
need for a graphical user interface is to view graphical plots
from the benchmarking.


