README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-29 lör 02:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PAPER 99: Improving Program Locality in the GC using Hotness</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tobias Wrigstad" />
</head>
<body>
<div id="content">
<h1 class="title">PAPER 99: Improving Program Locality in the GC using Hotness</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org91c2762">1. Overview</a></li>
<li><a href="#orgfbdb7c4">2. Getting Started</a>
<ul>
<li><a href="#orgcb76ff6">2.1. OPTION 1: Download Pre-Packaged Virtual Machine </a></li>
<li><a href="#org86b1e22">2.2. OPTION 2: Manual Build on Debian/Ubuntu </a></li>
</ul>
</li>
<li><a href="#org5f0cd6f">3. Step-by-Step</a>
<ul>
<li><a href="#org89a6f81">3.1. Running the Simplified Benchmarks</a>
<ul>
<li><a href="#org81c17ff">3.1.1. Kick-the-Tires Benchmark Fast (~15 minutes)</a></li>
<li><a href="#org095dc5f">3.1.2. Kick-the-Tires Benchmark Slow (optional &#x2013; note: ~1 day)</a></li>
<li><a href="#org1c716bf">3.1.3. Full Benchmark Slow (Weeks(!))</a></li>
<li><a href="#org33e9244">3.1.4. Exporting the Results for Viewing Outside the VM</a></li>
</ul>
</li>
<li><a href="#org97d0a9e">3.2. How to Evaluate this Artefact</a></li>
<li><a href="#orgb458a54">3.3. Viewing the Results</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org91c2762" class="outline-2">
<h2 id="org91c2762"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Paper 99 presents HCSGC, built on-top of the ZGC collector in
OpenJDK. HCSGC use the mutators (the applications' threads) to
relocate objects on the heap to improve their placement. As a
consequence of this design, objects touched by a mutator during
the relocation phase of the GC cycle will be laid out in access
order which may improve cache performance on subsequent accesses.
Furthermore, HCSGC can track objects' "hotness". An object is
"hot" if it was accessed during the last GC cycle, otherwise
"cold". During GC, hot objects and cold objects are segregated to
increase the density of hot objects, and weights can be assigned
to cold objects so that they count less towards the live bytes of
a ZGC memory page. This can be used to improve the selection of
what memory pages to relocate during GC, as GC is no longer only
concerned with freeing memory, but with improving object locality
in the program.
</p>

<p>
We demonstrate the impact of our design choices, and the
applicability of our techniques, through a selection of
benchmarks.
</p>

<p>
As the number of tuning knobs are relatively large, the paper
deals with 19 different configurations for each benchmark with
several runs (the exact number depending on the benchmark)
to reach a steady state. To save artefact reviewers' time, the we
provide a simple test script that generates Figure 4 from
the paper with a single run. We also provide
a medium-weight testing option to generate the full Figure 4-6 with
31 runs (same as in the paper). 
</p>

<p>
The full benchmarks<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> are also provided and can
take weeks to run, depending on the machine.
</p>

<p>
After the benchmarks are run, an HTML file is open that shows the
produced plots with links to the plots of the paper for
comparison.
</p>

<p>
This artefact consists of the following:
</p>

<ol class="org-ol">
<li>The sources for HCSGC in the form of a single patch file for
OpenJDK (<code>0001-hcsgc.patch</code>).</li>
<li><p>
The benchmark programs from our paper (§4):
</p>
<ul class="org-ul">
<li>Our "sanity check" micro benchmark from §4.4;</li>
<li>The JGraphT benchmark from §4.5; and</li>
<li>The DaCapo benchmark suite from which we run Tradebeans and h2 in §4.6.</li>
</ul>
<p>
NOTE: Due to copyright restrictions, we cannot include SPECjbb2015 in the artefact.
</p></li>
<li>A virtual machine containing all of the above, including
pre-built OpenJDK and HCSGC. As many virtual machine
environments do not support <code>perf</code> (which we rely on for cache
statistics), the full experience of this artefact is likely ony
possible with a native installation.</li>
<li>Scripts to automate running the the benchmarks and producing
the plots.</li>
</ol>

<p>
Beware that this artefact requires several gigabytes of disk space
for all dependencies and the build itself.
</p>
</div>
</div>

<div id="outline-container-orgfbdb7c4" class="outline-2">
<h2 id="orgfbdb7c4"><span class="section-number-2">2</span> Getting Started</h2>
<div class="outline-text-2" id="text-2">
<p>
This section explains how to install HCSGC alongside an OpenJDK
baseline. <a href="#org5f0cd6f">The next section</a> explains how to run the benchmarks. 
</p>

<p>
Please note that OpenJDK is a large project with many
dependencies, and that that our HCSGC paper compares 19 different
configurations which naturally takes some time to run. We explain
simplifications made to keep time short to kick the tires, and how
to run the full benchmarks to reproduc the results from the paper
(possibly modulo <code>perf</code>, when running inside a virtual machine).
</p>

<p>
We provide two different ways to explore this artefact. To
kick-the-tires, we suggest Option 1 (prebuilt VM). For someone
working deep in this space or wanting to fully reproduce our
results, we suggestion Option 2 (manual native install).
</p>

<ul class="org-ul">
<li><a href="#org548968c">Option 1</a> is a full VM download. This requires no other setup or
installation other than the virtual machine infrastructure, but
requires a download of ~8 gigabytes.</li>
<li><a href="#org16417d7">Option 2</a> is a set of manual instructions for how to build and
install HCSGC on Debian/Ubuntu.</li>
</ul>

<p>
Notes: Option 1, due to running inside virtual machines, typically
<b>cannot</b> record perf data and may skew the results. 
</p>
</div>


<div id="outline-container-orgcb76ff6" class="outline-3">
<h3 id="orgcb76ff6"><span class="section-number-3">2.1</span> OPTION 1: Download Pre-Packaged Virtual Machine <a id="org548968c"></a></h3>
<div class="outline-text-3" id="text-2-1">
<p>
You can use your favorite virtualisation software. We have tested
this VM using <a href="https://www.virtualbox.org/">Virtual Box</a>.
</p>

<p>
The Virtual machine can be downloaded from here: <a href="http://wrigstad.com/paper99.zip">http://wrigstad.com/paper99.zip</a>
(Since you are reading this file, you are probably already past this step. In that case, 
you can find the virtual machine as <code>pldi.ova</code> inside the above-mentioned zip file.)
</p>

<p>
After importing the VM, start and login to the VM with the
following credentials:
</p>

<pre class="example">
user: vagrant
password: vagrant
</pre>

<p>
See <a href="#org5f0cd6f">the next section</a> for instructions for how to run the
benchmarks. 
</p>

<p>
All interaction with the VM will happen in the terminal. The only
need for a graphical user interface is to view graphical plots
from the benchmarking. 
</p>
</div>
</div>
