README.org
** OPTION 2: Manual Build on Debian/Ubuntu <<option2>>

Because of the large number of dependencies for OpenJDK, we limit ourselves to
providing manual instructions for building on debian/ubuntu. At the time we
implemented HCSGC, ZGC, which we build upon, was only available for 64bit Linux.

Create a directory for the artefact, e.g. =mkdir ~/paper99; cd ~/paper99=. All
commands from now on are assumed to be issued from within that directory.

After uncompressing the artifact, you will see the following files and
directories (discarding the .ova VM file):

#+BEGIN_EXAMPLE
~paper99
  ├── 0001-hcsgc.patch  <-- HCSGC sources patch
  ├── benchmarks        <-- benchmark programs & scripts for running/plotting
  ├── jtreg             <-- OpenJDK build dependency
  ├── LICENSE
  ├── README.html
  ├── README.org
  └── README.txt
#+END_EXAMPLE

Install the basic building blocks:
#+BEGIN_EXAMPLE
sudo apt-get install -y build-essential autoconf git git-lfs
#+END_EXAMPLE

Utilities
#+BEGIN_EXAMPLE
sudo apt-get install -y curl perf-tools-unstable time util-linux
#+END_EXAMPLE
(Note that sometimes, the =perf-tools-unstable= package naming may vary.)

Make sure you have the permissions to use =perf=:
#+BEGIN_EXAMPLE
sudo sh -c 'echo -1 > /proc/sys/kernel/perf_event_paranoid'
#+END_EXAMPLE

Install OpenJDK dependencies
#+BEGIN_EXAMPLE
sudo apt-get install -y zip unzip libx11-dev libxext-dev libxrender-dev libxrandr-dev libxtst-dev libxt-dev libcups2-dev libfontconfig1-dev libasound2-dev
#+END_EXAMPLE
Note that you need a graphical environment to build OpenJDK. If you don't have that, OpenJDK will complain and suggest packages that will remedy the situation.


You also need to have a Java installation. If you can install OpenJDK 13 or above, this will simplify things later:
#+BEGIN_EXAMPLE
sudo apt-get install -y openjdk-13-jdk-headless
#+END_EXAMPLE
*Otherwise, you will still need one to build the benchmark.* Either of the following should work:
#+BEGIN_EXAMPLE
sudo apt-get install -y openjdk-11-jdk-headless
sudo apt-get install -y openjdk-8-jdk-headless
#+END_EXAMPLE

If you could not install OpenJDK 13 above, you *need* to install modern boot JDK to build:
#+BEGIN_EXAMPLE
curl -O https://download.java.net/java/GA/jdk13.0.2/d4173c853231432d94f001e99d882ca7/8/GPL/openjdk-13.0.2_linux-x64_bin.tar.gz
tar zxf openjdk-13.0.2_linux-x64_bin.tar.gz
#+END_EXAMPLE
(If you can install =openjdk-13-jdk-headless=, you can skip this step and omit the =--with-boot-jdk= flag when running =configure= later.)

Clone baseline JDK from GitHub mirror, and checkout the commit on-top of which HCSGC was authored.
#+BEGIN_EXAMPLE
git clone https://github.com/openjdk/jdk.git openjdk
cd openjdk
git checkout 67a89143dde6e545adbfc3c79bb89d954307f8bc
cd ..
#+END_EXAMPLE

Create a copy of the baseline to build HCSGC.
#+BEGIN_EXAMPLE
cp -R openjdk hcsgc
#+END_EXAMPLE

Configure and finally build OpenJDK.
#+BEGIN_EXAMPLE
cd openjdk
bash configure --with-target-bits=64 --with-native-debug-symbols=none --with-jtreg=../jtreg --with-boot-jdk=../jdk-13.0.2 --disable-warnings-as-errors --with-extra-cflags='-Wno-nonnull-compare -Wno-format -Wno-stringop-truncation ' --with-extra-cxxflags='-std=gnu++11'
make CONF=release
bash configure --enable-debug --with-target-bits=64 --with-native-debug-symbols=internal --with-jtreg=../jtreg --with-boot-jdk=../jdk-13.0.2 --disable-warnings-as-errors --with-extra-cflags='-Wno-nonnull-compare -Wno-format -Wno-stringop-truncation ' --with-extra-cxxflags='-std=gnu++11'
make CONF=debug
cd ..
#+END_EXAMPLE
(If you did install =openjdk-13-jdk-headless= using apt, skip the =--with-boot-jdk= flag above.)

Patch OpenJDK with the HCSGC patch.
#+BEGIN_EXAMPLE
cd hcsgc
git am < ../0001-hcsgc.patch
#+END_EXAMPLE

Configure and finally build OpenJDK/HCSGC.
#+BEGIN_EXAMPLE
bash configure --with-target-bits=64 --with-native-debug-symbols=none --with-jtreg=../jtreg --with-boot-jdk=../jdk-13.0.2 --disable-warnings-as-errors --with-extra-cflags='-Wno-nonnull-compare -Wno-format -Wno-stringop-truncation ' --with-extra-cxxflags='-std=gnu++11'
make CONF=release
bash configure --enable-debug --with-target-bits=64 --with-native-debug-symbols=internal --with-jtreg=../jtreg --with-boot-jdk=../jdk-13.0.2 --disable-warnings-as-errors --with-extra-cflags='-Wno-nonnull-compare -Wno-format -Wno-stringop-truncation ' --with-extra-cxxflags='-std=gnu++11'
make CONF=debug
cd ..
#+END_EXAMPLE
(If you did install =openjdk-13-jdk-headless= using apt, skip the =--with-boot-jdk= flag above.)

Note that the ~make~ steps will take a long time. Using ~make -j
<#jobs>~ is not needed, because the ~bash configure ...~ step has
already picked up the number of cores availalbe on the machine so
that ~make~ alone will do a parallel build. More documentation on
this can be viewed at the office OpenJDK
[[https://github.com/openjdk/jdk/blob/master/doc/building.md][repo]].

After building, the baseline =java= and binary is available in
=~/paper99/openjdk/build/linux-x86_64-server-release/jdk/bin/=,
and the HCSGC build in
=~/paper99/hcsgc/build/linux-x86_64-server-release/jdk/bin/=
(debug builds in =linux-x86_64-server-fastdebug=). However, you do
not need to use these directly, as scripts for running the
individual benchmarks are provided. This is detailed in the next
section.

Finally, to extract data from logs and plot the data, some additional tools are needed:
#+BEGIN_EXAMPLE
wget -qO- https://get.haskellstack.org/ | sh
stack install ghc
stack install turtle

sudo apt-get install -y ruby octave octave-statistics zsh
#+END_EXAMPLE


#+begin_quote
Finally, *unless* you placed the ~paper99~ directory directly
under =~=, you must edit certain files to reflect the location of
this project. In =benchmark/Makefile=, change the first line to
indicate project root. In =benchmark/programs/hcsgc_engine.hs= and
=benchmark/programs/hcsgc_engine_single_core.hs=, change the paths
to the newly built OpenJDK and HCSGC binaries (lines 43, 44, 46,
and 47 in both files). *If you skip this step, the benchmark
scripts will not run!*
#+end_quote

* Step-by-Step

This section contains instructions for running the benchmarks from
the paper (again, excluding SPECjbb2015 for copyright reasons).

A text describing how to evaluate the results is found in the file
=result.html= in the =benchmarks= directory, and which is opened
automatically when the benchmarks finish (inside the VM) and
contains all the plots with accompanying text (mostly adapted from
the paper).


