README.html



<div id="outline-container-org86b1e22" class="outline-3">
<h3 id="org86b1e22"><span class="section-number-3">2.2</span> OPTION 2: Manual Build on Debian/Ubuntu <a id="org16417d7"></a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
Because of the large number of dependencies for OpenJDK, we limit
ourselves to providing manual instructions for building on
debian/ubuntu. At the time we implemented HCSGC, ZGC, which we
build upon, was only available for 64bit Linux. 
</p>

<p>
Create a directory for the artefact, e.g. <code>mkdir ~/paper99; cd
~/paper99</code>. All commands from now on are assumed to be issued from
within that directory.
</p>

<p>
Download the benchmark programs and scripts from
<a href="http://wrigstad.com/paper99.zip">http://wrigstad.com/paper99.zip</a> (discard the .ova VM file) and extract into <code>~/paper99</code>.
This will give you the following files and directories:
</p>

<pre class="example">
~paper99
  ├── 0001-hcsgc.patch  &lt;-- HCSGC sources patch
  ├── benchmarks        &lt;-- our benchmark programs
  ├── jtreg             &lt;-- OpenJDK build dependency
  ├── README.html       
  ├── README.org
  └── README.txt
</pre>

<p>
Install the basic building blocks:
</p>
<pre class="example">
sudo apt-get install -y build-essential autoconf git git-lfs
</pre>

<p>
Utilities
</p>
<pre class="example">
sudo apt-get install -y curl perf-tools-unstable time util-linux
</pre>
<p>
(Note that sometimes, the <code>perf-tools-unstable</code> package naming may vary.)
</p>

<p>
Make sure you have the permissions to use <code>perf</code>:
</p>
<pre class="example">
sudo sh -c 'echo -1 &gt; /proc/sys/kernel/perf_event_paranoid'
</pre>

<p>
Install OpenJDK dependencies
</p>
<pre class="example">
sudo apt-get install -y zip unzip libx11-dev libxext-dev libxrender-dev libxrandr-dev libxtst-dev libxt-dev libcups2-dev libfontconfig1-dev libasound2-dev
</pre>
<p>
Note that you need a graphical environment to build OpenJDK. If you don't have that, OpenJDK will complain and suggest packages that will remedy the situation.
</p>


<p>
You also need to have a Java installation. If you can install OpenJDK 13 or above, this will simplify things later:
</p>
<pre class="example">
sudo apt-get install -y openjdk-13-jdk-headless
</pre>
<p>
<b>Otherwise, you will still need one to build the benchmark.</b> Either of the following should work:
</p>
<pre class="example">
sudo apt-get install -y openjdk-11-jdk-headless
sudo apt-get install -y openjdk-8-jdk-headless
</pre>

<p>
If you could not install OpenJDK 13 above, you <b>need</b> to install modern boot JDK to build:
</p>
<pre class="example">
curl -O https://download.java.net/java/GA/jdk13.0.2/d4173c853231432d94f001e99d882ca7/8/GPL/openjdk-13.0.2_linux-x64_bin.tar.gz 
tar zxf openjdk-13.0.2_linux-x64_bin.tar.gz
</pre>
<p>
(If you can install <code>openjdk-13-jdk-headless</code>, you can skip this step and omit the <code>--with-boot-jdk</code> flag when running <code>configure</code> later.)
</p>

<p>
Clone baseline JDK from GitHub mirror, and checkout the commit on-top of which HCSGC was authored.
</p>
<pre class="example">
git clone https://github.com/openjdk/jdk.git openjdk
cd openjdk
git checkout 67a89143dde6e545adbfc3c79bb89d954307f8bc
cd ..
</pre>

<p>
Create a copy of the baseline to build HCSGC.
</p>
<pre class="example">
cp -R openjdk hcsgc
</pre>

<p>
Configure and finally build OpenJDK.
</p>
<pre class="example">
cd openjdk
bash configure --with-target-bits=64 --with-native-debug-symbols=none --with-jtreg=../jtreg --with-boot-jdk=../jdk-13.0.2 --disable-warnings-as-errors --with-extra-cflags='-Wno-nonnull-compare -Wno-format -Wno-stringop-truncation ' --with-extra-cxxflags='-std=gnu++11'
make CONF=release
bash configure --enable-debug --with-target-bits=64 --with-native-debug-symbols=internal --with-jtreg=../jtreg --with-boot-jdk=../jdk-13.0.2 --disable-warnings-as-errors --with-extra-cflags='-Wno-nonnull-compare -Wno-format -Wno-stringop-truncation ' --with-extra-cxxflags='-std=gnu++11'
make CONF=debug
cd ..
</pre>
<p>
(If you did install <code>openjdk-13-jdk-headless</code> using apt, skip the <code>--with-boot-jdk</code> flag above.)
</p>

<p>
Patch OpenJDK with the HCSGC patch. 
</p>
<pre class="example">
cd hcsgc 
git am &lt; ../0001-hcsgc.patch
</pre>

<p>
Configure and finally build OpenJDK/HCSGC. 
</p>
<pre class="example">
bash configure --with-target-bits=64 --with-native-debug-symbols=none --with-jtreg=../jtreg --with-boot-jdk=../jdk-13.0.2 --disable-warnings-as-errors --with-extra-cflags='-Wno-nonnull-compare -Wno-format -Wno-stringop-truncation ' --with-extra-cxxflags='-std=gnu++11'
make CONF=release
bash configure --enable-debug --with-target-bits=64 --with-native-debug-symbols=internal --with-jtreg=../jtreg --with-boot-jdk=../jdk-13.0.2 --disable-warnings-as-errors --with-extra-cflags='-Wno-nonnull-compare -Wno-format -Wno-stringop-truncation ' --with-extra-cxxflags='-std=gnu++11'
make CONF=debug
cd ..
</pre>
<p>
(If you did install <code>openjdk-13-jdk-headless</code> using apt, skip the <code>--with-boot-jdk</code> flag above.)
</p>

<p>
Note that the <code>make</code> steps will take a long time. 
</p>

<p>
After building, the baseline <code>java</code> and binary is available in
<code>~/paper99/openjdk/build/linux-x86_64-server-release/jdk/bin/</code>,
and the HCSGC build in
<code>~/paper99/hcsgc/build/linux-x86_64-server-release/jdk/bin/</code>
(debug builds in <code>linux-x86_64-server-fastdebug</code>). However, you do
not need to use these directly, as scripts for running the
individual benchmarks are provided. This is detailed in the next
section.
</p>

<p>
Finally, to extract data from logs and plot the data, some additional tools are needed:
</p>
<pre class="example">
wget -qO- https://get.haskellstack.org/ | sh
stack install ghc
stack install turtle

sudo apt-get install -y ruby octave octave-statistics zsh
</pre>


<blockquote>
<p>
Finally, <b>unless</b> you placed the <code>paper99</code> directory directly
under <code>~</code>, you must edit <code>hcsgc_engine.hs</code> and <code>hcsgc_engine_single_core.hs</code> and
change the paths to the newly built OpenJDK and HCSGC binaries (lines 43, 44, 46, and 47 in both files). 
<b>If you skip this step, the benchmark scripts will not run!</b>
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org5f0cd6f" class="outline-2">
<h2 id="org5f0cd6f"><span class="section-number-2">3</span> Step-by-Step</h2>
<div class="outline-text-2" id="text-3">
<p>
This section contains instructions for running the benchmarks from
the paper (again, excluding SPECjbb2015 for copyright reasons).
</p>

<p>
A text describing how to evaluate the results is found in the file
<code>result.html</code> in the <code>benchmarks</code> directory, and which is opened
automatically when the benchmarks finish (inside the VM) and
contains all the plots with accompanying text (mostly adapted from
the paper).
</p>
</div>
