README.org
** Running the Simplified Benchmarks

Due to the large number of configurations, and the large number of
runs needed for statistical significance, running the
benchmarks is *very time consuming*, and is expected to take at
least 24 hours on a modern laptop.

To this end, we provide a simplified benchmark setting where we
only run the synthetic benchmark for a single run (for each
19 configurations) that is intended to prove that HCSGC is indeed
built correctly, and that its tuning knobs do work (because
different configurations do see different results).

Based on our experience, we estimate the following run-times for
the benchmarks:

| Benchmark        | Run-time |
|------------------+----------|
| synthetic        | 5h       |
| synthetic phases | 15h      |
| synthetic cold   | 7h       |
| cc-uk            | 7h       |
| cc-enwiki        | 7h       |
| mc-uk            | 40h      |
| mc-enwiki        | 32h      |
| tradebeans       | 98h      |
| h2               | 158h     |

*** Kick-the-Tires Benchmark Fast (~15 minutes)

| Benchmark | Figure in Paper | Runs         | Configurations |
|-----------+-----------------+--------------+----------------|
| synthetic | Fig. 4          | 1 (see note) |             19 |

*Note:* To avoid changing the scripts, we copy the resulting logs
31 times to fake the 31 runs that we ran in the paper. Naturally
this setting cannot be used to obtain any results with any
statistical significance, and any jitter on your machine could
skew the results.

To run this benchmark, which should take 15 minutes (in =~/benchmarks= on VM or =~/paper99/benchmarks= in the manual install):

#+BEGIN_EXAMPLE
zsh
make test
#+END_EXAMPLE

This compiles the synthetic benchmark, runs the parts of it
relevant for Figure 4, produces the corresponding plots and opens
a browser to show them together with accompanying text.

*** Kick-the-Tires Benchmark Slow (optional -- note: ~1 day)

| Benchmark        | Figure in Paper | Runs | Configurations |
|------------------+-----------------+------+----------------|
| synthetic        | Fig. 4          |   31 |             19 |
| synthetic phases | Fig. 5          |   31 |             19 |
| synthetic cold   | Fig. 6          |   31 |             19 |


To run the synthetic benchmarks for Figure 4 with the full 31
runs from the paper (in =~/benchmarks= on VM or =~/paper99/benchmarks= in the manual install):

#+BEGIN_EXAMPLE
zsh
make test_full
#+END_EXAMPLE

*** Full Benchmark Slow (Weeks(!))

| Benchmark            | Figure in Paper |                 Runs | Configurations |
|----------------------+-----------------+----------------------+----------------|
| synthetic            | Fig. 4          |                   31 |             19 |
| synthetic phases     | Fig. 5          |                   31 |             19 |
| synthetic cold       | Fig. 6          |                   31 |             19 |
|----------------------+-----------------+----------------------+----------------|
| jgrapht suite        | Fig. 7-10       |                   31 |             19 |
|----------------------+-----------------+----------------------+----------------|
| dacapo h2/tradebeans | Fig. 11-12      | 5 (25 iters per run) |             19 |




Finally, to run the *full* benchmarks from the paper (in =~/benchmarks= on VM or =~/paper99/benchmarks= in the manual install):

#+BEGIN_EXAMPLE
zsh
make bench
#+END_EXAMPLE

This compiles all benchmarks (DaCapo is provided as a jar file),
runs all the benchmarks, produces the plots and finally opens a
browser to show the results together with accompanying text.

The plots are are placed in
=data/images/evaluation/= under the =benchmark= directory. The file
=results.html= in the =benchmark= directory shows all the plots in a single HTML
file together with pointers to the paper and a discussion of their
interpretation. The directory
=submitted_evaluation= contains the
plots from the paper for comparison and all these figures are shown in =results.html=.

*** Exporting the Results for Viewing Outside the VM

You can create a zip file, =results.zip=, with all the plots and
=results.html= like so:

#+BEGIN_EXAMPLE
make zip
#+END_EXAMPLE

And use whatever means to export the zip file. The simplest way is
probably by using =scp= to copy =results.zip= to some other machine.


** How to Evaluate this Artefact

This is described in [[file:benchmarks/results.html][results.html]] along with the figures produced
by running the benchmark scripts using the makefile as detailed
above.


** Viewing the Results

The file [[file:benchmarks/results.html][results.html]] is opened by the main makefile after
benchmarking. Should you wish to open it again without rerunning
the benchmarks:

#+BEGIN_EXAMPLE
make view
#+END_EXAMPLE


