README.html


<div id="outline-container-org89a6f81" class="outline-3">
<h3 id="org89a6f81"><span class="section-number-3">3.1</span> Running the Simplified Benchmarks</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Due to the large number of configurations, and the large number of
runs needed for statistical significance, running the
benchmarks is <b>very time consuming</b>, and is expected to take at
least 24 hours on a modern laptop. 
</p>

<p>
To this end, we provide a simplified benchmark setting where we
only run the synthetic benchmark for a single run (for each
19 configurations) that is intended to prove that HCSGC is indeed
built correctly, and that its tuning knobs do work (because
different configurations do see different results). 
</p>

<p>
Based on our experience, we estimate the following run-times for
the benchmarks:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Benchmark</th>
<th scope="col" class="org-left">Run-time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">synthetic</td>
<td class="org-left">5h</td>
</tr>

<tr>
<td class="org-left">synthetic phases</td>
<td class="org-left">15h</td>
</tr>

<tr>
<td class="org-left">synthetic cold</td>
<td class="org-left">7h</td>
</tr>

<tr>
<td class="org-left">cc-uk</td>
<td class="org-left">7h</td>
</tr>

<tr>
<td class="org-left">cc-enwiki</td>
<td class="org-left">7h</td>
</tr>

<tr>
<td class="org-left">mc-uk</td>
<td class="org-left">40h</td>
</tr>

<tr>
<td class="org-left">mc-enwiki</td>
<td class="org-left">32h</td>
</tr>

<tr>
<td class="org-left">tradebeans</td>
<td class="org-left">98h</td>
</tr>

<tr>
<td class="org-left">h2</td>
<td class="org-left">158h</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org81c17ff" class="outline-4">
<h4 id="org81c17ff"><span class="section-number-4">3.1.1</span> Kick-the-Tires Benchmark Fast (~15 minutes)</h4>
<div class="outline-text-4" id="text-3-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Benchmark</th>
<th scope="col" class="org-left">Figure in Paper</th>
<th scope="col" class="org-left">Runs</th>
<th scope="col" class="org-right">Configurations</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">synthetic</td>
<td class="org-left">Fig. 4</td>
<td class="org-left">1 (see note)</td>
<td class="org-right">19</td>
</tr>
</tbody>
</table>

<p>
<b>Note:</b> To avoid changing the scripts, we copy the resulting logs
31 times to fake the 31 runs that we ran in the paper. Naturally
this setting cannot be used to obtain any results with any
statistical significance, and any jitter on your machine could
skew the results.
</p>

<p>
To run this benchmark, which should take 15 minutes (in <code>~/benchmarks</code> on VM or <code>~/paper99/benchmarks</code> in the manual install):
</p>

<pre class="example">
zsh
make test
</pre>

<p>
This compiles the synthetic benchmark, runs the parts of it
relevant for Figure 4, produces the corresponding plots and opens
a browser to show them together with accompanying text.
</p>
</div>
</div>

<div id="outline-container-org095dc5f" class="outline-4">
<h4 id="org095dc5f"><span class="section-number-4">3.1.2</span> Kick-the-Tires Benchmark Slow (optional &#x2013; note: ~1 day)</h4>
<div class="outline-text-4" id="text-3-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Benchmark</th>
<th scope="col" class="org-left">Figure in Paper</th>
<th scope="col" class="org-right">Runs</th>
<th scope="col" class="org-right">Configurations</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">synthetic</td>
<td class="org-left">Fig. 4</td>
<td class="org-right">31</td>
<td class="org-right">19</td>
</tr>

<tr>
<td class="org-left">synthetic phases</td>
<td class="org-left">Fig. 5</td>
<td class="org-right">31</td>
<td class="org-right">19</td>
</tr>

<tr>
<td class="org-left">synthetic cold</td>
<td class="org-left">Fig. 6</td>
<td class="org-right">31</td>
<td class="org-right">19</td>
</tr>
</tbody>
</table>


<p>
To run the synthetic benchmarks for Figure 4 with the full 31
runs from the paper (in <code>~/benchmarks</code> on VM or <code>~/paper99/benchmarks</code> in the manual install):
</p>

<pre class="example">
zsh
make test_full
</pre>
</div>
</div>

<div id="outline-container-org1c716bf" class="outline-4">
<h4 id="org1c716bf"><span class="section-number-4">3.1.3</span> Full Benchmark Slow (Weeks(!))</h4>
<div class="outline-text-4" id="text-3-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Benchmark</th>
<th scope="col" class="org-left">Figure in Paper</th>
<th scope="col" class="org-right">Runs</th>
<th scope="col" class="org-right">Configurations</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">synthetic</td>
<td class="org-left">Fig. 4</td>
<td class="org-right">31</td>
<td class="org-right">19</td>
</tr>

<tr>
<td class="org-left">synthetic phases</td>
<td class="org-left">Fig. 5</td>
<td class="org-right">31</td>
<td class="org-right">19</td>
</tr>

<tr>
<td class="org-left">synthetic cold</td>
<td class="org-left">Fig. 6</td>
<td class="org-right">31</td>
<td class="org-right">19</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">jgrapht suite</td>
<td class="org-left">Fig. 7-10</td>
<td class="org-right">31</td>
<td class="org-right">19</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">dacapo h2/tradebeans</td>
<td class="org-left">Fig. 11-12</td>
<td class="org-right">5 (25 iters per run)</td>
<td class="org-right">19</td>
</tr>
</tbody>
</table>




<p>
Finally, to run the <b>full</b> benchmarks from the paper (in <code>~/benchmarks</code> on VM or <code>~/paper99/benchmarks</code> in the manual install):
</p>

<pre class="example">
zsh
make bench
</pre>

<p>
This compiles all benchmarks (Dacapo is provided as a jar file),
runs all the benchmarks, produces the plots and finally opens a
browser to show the results together with accompanying text.
</p>

<p>
The plots are are placed in
<code>data/images/evaluation/</code> under the <code>benchmark</code> directory. The file
<code>results.html</code> in the <code>benchmark</code> directory shows all the plots in a single HTML
file together with pointers to the paper and a discussion of their
interpretation. The directory
<code>submitted_evaluation</code> contains the
plots from the paper for comparison and all these figures are shown in <code>results.html</code>.
</p>
</div>
</div>

<div id="outline-container-org33e9244" class="outline-4">
<h4 id="org33e9244"><span class="section-number-4">3.1.4</span> Exporting the Results for Viewing Outside the VM</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
You can create a zip file, <code>results.zip</code>, with all the plots and
<code>results.html</code> like so:
</p>

<pre class="example">
make zip
</pre>

<p>
And use whatever means to export the zip file. The simplest way is
probably by using <code>scp</code> to copy <code>results.zip</code> to some other machine. 
</p>
</div>
</div>
</div>


<div id="outline-container-org97d0a9e" class="outline-3">
<h3 id="org97d0a9e"><span class="section-number-3">3.2</span> How to Evaluate this Artefact</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This is described in <a href="benchmarks/results.html">results.html</a> along with the figures produced
by running the benchmark scripts using the makefile as detailed
above.
</p>
</div>
</div>


<div id="outline-container-orgb458a54" class="outline-3">
<h3 id="orgb458a54"><span class="section-number-3">3.3</span> Viewing the Results</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The file <a href="benchmarks/results.html">results.html</a> is opened by the main makefile after
benchmarking. Should you wish to open it again without rerunning
the benchmarks:
</p>

<pre class="example">
make view
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">Except for SPECJbb2015 which cannot be
included due to copyright restrictions.</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Tobias Wrigstad</p>
<p class="date">Created: 2020-02-29 lör 02:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
